; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=110, out_folder=htg/blocksworld/training, instance_id=90, seed=2114, goal_proportion=0.1

(define (problem blocksworld-90)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 - object)
 (:init 
    (arm-empty)
    (clear b54)
    (on b54 b36)
    (on b36 b58)
    (on b58 b56)
    (on-table b56)
    (clear b21)
    (on-table b21)
    (clear b59)
    (on b59 b62)
    (on b62 b79)
    (on b79 b10)
    (on b10 b57)
    (on b57 b24)
    (on b24 b95)
    (on b95 b14)
    (on b14 b84)
    (on b84 b42)
    (on b42 b75)
    (on b75 b11)
    (on b11 b41)
    (on b41 b83)
    (on b83 b72)
    (on b72 b65)
    (on b65 b49)
    (on b49 b53)
    (on b53 b22)
    (on b22 b108)
    (on b108 b105)
    (on-table b105)
    (clear b51)
    (on b51 b87)
    (on b87 b29)
    (on-table b29)
    (clear b80)
    (on-table b80)
    (clear b40)
    (on-table b40)
    (clear b52)
    (on b52 b96)
    (on b96 b77)
    (on b77 b85)
    (on b85 b25)
    (on b25 b15)
    (on-table b15)
    (clear b88)
    (on b88 b89)
    (on b89 b12)
    (on b12 b47)
    (on b47 b18)
    (on b18 b37)
    (on b37 b34)
    (on b34 b61)
    (on b61 b45)
    (on-table b45)
    (clear b46)
    (on-table b46)
    (clear b27)
    (on b27 b104)
    (on-table b104)
    (clear b23)
    (on b23 b30)
    (on b30 b97)
    (on b97 b55)
    (on b55 b107)
    (on-table b107)
    (clear b103)
    (on-table b103)
    (clear b2)
    (on b2 b39)
    (on b39 b4)
    (on-table b4)
    (clear b90)
    (on b90 b91)
    (on b91 b67)
    (on-table b67)
    (clear b16)
    (on-table b16)
    (clear b73)
    (on b73 b76)
    (on b76 b50)
    (on b50 b71)
    (on b71 b102)
    (on b102 b93)
    (on-table b93)
    (clear b48)
    (on b48 b81)
    (on b81 b5)
    (on-table b5)
    (clear b19)
    (on b19 b100)
    (on b100 b6)
    (on b6 b98)
    (on-table b98)
    (clear b70)
    (on b70 b78)
    (on b78 b13)
    (on b13 b92)
    (on b92 b74)
    (on-table b74)
    (clear b68)
    (on b68 b1)
    (on b1 b8)
    (on-table b8)
    (clear b94)
    (on b94 b82)
    (on b82 b106)
    (on b106 b63)
    (on b63 b38)
    (on b38 b9)
    (on b9 b43)
    (on b43 b3)
    (on-table b3)
    (clear b109)
    (on-table b109)
    (clear b17)
    (on-table b17)
    (clear b20)
    (on-table b20)
    (clear b33)
    (on b33 b101)
    (on b101 b44)
    (on b44 b69)
    (on-table b69)
    (clear b32)
    (on b32 b26)
    (on b26 b7)
    (on b7 b35)
    (on b35 b64)
    (on-table b64)
    (clear b99)
    (on-table b99)
    (clear b66)
    (on-table b66)
    (clear b110)
    (on-table b110)
    (clear b60)
    (on b60 b86)
    (on-table b86)
    (clear b28)
    (on b28 b31)
    (on-table b31))
 (:goal  (and 
    (clear b1)
    (on b1 b9)
    (on b9 b4)
    (on-table b4)
    (clear b3)
    (on b3 b8)
    (on-table b8)
    (clear b5)
    (on b5 b10)
    (on b10 b7)
    (on-table b7)
    (clear b11)
    (on-table b11)
    (clear b2)
    (on b2 b6)
    (on-table b6))))

; plan
1. (unstack b68 b1)
   deleted: (on b68 b1) (clear b68) (arm-empty)
   added: (holding b68) (clear b1)
   goals met: 4 of 16
2. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 4 of 16
3. (unstack b48 b81)
   deleted: (on b48 b81) (clear b48) (arm-empty)
   added: (holding b48) (clear b81)
   goals met: 4 of 16
4. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 4 of 16
5. (unstack b81 b5)
   deleted: (on b81 b5) (clear b81) (arm-empty)
   added: (holding b81) (clear b5)
   goals met: 5 of 16
6. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 16
7. (unstack b19 b100)
   deleted: (on b19 b100) (clear b19) (arm-empty)
   added: (holding b19) (clear b100)
   goals met: 5 of 16
8. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 16
9. (unstack b100 b6)
   deleted: (on b100 b6) (clear b100) (arm-empty)
   added: (holding b100) (clear b6)
   goals met: 5 of 16
10. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 5 of 16
11. (unstack b6 b98)
   deleted: (on b6 b98) (clear b6) (arm-empty)
   added: (holding b6) (clear b98)
   goals met: 5 of 16
12. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 16
13. (unstack b2 b39)
   deleted: (on b2 b39) (clear b2) (arm-empty)
   added: (holding b2) (clear b39)
   goals met: 5 of 16
14. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 7 of 16
15. (unstack b32 b26)
   deleted: (on b32 b26) (clear b32) (arm-empty)
   added: (holding b32) (clear b26)
   goals met: 7 of 16
16. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 7 of 16
17. (unstack b26 b7)
   deleted: (on b26 b7) (clear b26) (arm-empty)
   added: (holding b26) (clear b7)
   goals met: 7 of 16
18. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 7 of 16
19. (unstack b7 b35)
   deleted: (on b7 b35) (clear b7) (arm-empty)
   added: (holding b7) (clear b35)
   goals met: 7 of 16
20. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 16
21. (unstack b59 b62)
   deleted: (on b59 b62) (clear b59) (arm-empty)
   added: (holding b59) (clear b62)
   goals met: 8 of 16
22. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 8 of 16
23. (unstack b62 b79)
   deleted: (on b62 b79) (clear b62) (arm-empty)
   added: (holding b62) (clear b79)
   goals met: 8 of 16
24. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 8 of 16
25. (unstack b79 b10)
   deleted: (on b79 b10) (clear b79) (arm-empty)
   added: (holding b79) (clear b10)
   goals met: 8 of 16
26. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 8 of 16
27. (unstack b10 b57)
   deleted: (on b10 b57) (clear b10) (arm-empty)
   added: (holding b10) (clear b57)
   goals met: 8 of 16
28. (stack b10 b7)
   deleted: (clear b7) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b7)
   goals met: 9 of 16
29. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 8 of 16
30. (stack b5 b10)
   deleted: (clear b10) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b10)
   goals met: 10 of 16
31. (unstack b94 b82)
   deleted: (on b94 b82) (clear b94) (arm-empty)
   added: (holding b94) (clear b82)
   goals met: 10 of 16
32. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 10 of 16
33. (unstack b82 b106)
   deleted: (on b82 b106) (clear b82) (arm-empty)
   added: (holding b82) (clear b106)
   goals met: 10 of 16
34. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 10 of 16
35. (unstack b106 b63)
   deleted: (on b106 b63) (clear b106) (arm-empty)
   added: (holding b106) (clear b63)
   goals met: 10 of 16
36. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 10 of 16
37. (unstack b63 b38)
   deleted: (on b63 b38) (clear b63) (arm-empty)
   added: (holding b63) (clear b38)
   goals met: 10 of 16
38. (putdown b63)
   deleted: (holding b63)
   added: (clear b63) (arm-empty) (on-table b63)
   goals met: 10 of 16
39. (unstack b38 b9)
   deleted: (on b38 b9) (clear b38) (arm-empty)
   added: (holding b38) (clear b9)
   goals met: 10 of 16
40. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 10 of 16
41. (unstack b9 b43)
   deleted: (on b9 b43) (clear b9) (arm-empty)
   added: (holding b9) (clear b43)
   goals met: 10 of 16
42. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 10 of 16
43. (unstack b43 b3)
   deleted: (on b43 b3) (clear b43) (arm-empty)
   added: (holding b43) (clear b3)
   goals met: 11 of 16
44. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 11 of 16
45. (unstack b57 b24)
   deleted: (on b57 b24) (clear b57) (arm-empty)
   added: (holding b57) (clear b24)
   goals met: 11 of 16
46. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 11 of 16
47. (unstack b1 b8)
   deleted: (on b1 b8) (clear b1) (arm-empty)
   added: (holding b1) (clear b8)
   goals met: 10 of 16
48. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 12 of 16
49. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 11 of 16
50. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 13 of 16
51. (unstack b24 b95)
   deleted: (on b24 b95) (clear b24) (arm-empty)
   added: (holding b24) (clear b95)
   goals met: 13 of 16
52. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 13 of 16
53. (unstack b95 b14)
   deleted: (on b95 b14) (clear b95) (arm-empty)
   added: (holding b95) (clear b14)
   goals met: 13 of 16
54. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 13 of 16
55. (unstack b14 b84)
   deleted: (on b14 b84) (clear b14) (arm-empty)
   added: (holding b14) (clear b84)
   goals met: 13 of 16
56. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 13 of 16
57. (unstack b84 b42)
   deleted: (on b84 b42) (clear b84) (arm-empty)
   added: (holding b84) (clear b42)
   goals met: 13 of 16
58. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 13 of 16
59. (unstack b42 b75)
   deleted: (on b42 b75) (clear b42) (arm-empty)
   added: (holding b42) (clear b75)
   goals met: 13 of 16
60. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 13 of 16
61. (unstack b75 b11)
   deleted: (on b75 b11) (clear b75) (arm-empty)
   added: (holding b75) (clear b11)
   goals met: 14 of 16
62. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 14 of 16
63. (unstack b11 b41)
   deleted: (on b11 b41) (clear b11) (arm-empty)
   added: (holding b11) (clear b41)
   goals met: 13 of 16
64. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 15 of 16
65. (unstack b39 b4)
   deleted: (on b39 b4) (clear b39) (arm-empty)
   added: (holding b39) (clear b4)
   goals met: 15 of 16
66. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 15 of 16
67. (unstack b1 b9)
   deleted: (on b1 b9) (clear b1) (arm-empty)
   added: (holding b1) (clear b9)
   goals met: 13 of 16
68. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 14 of 16
69. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 14 of 16
70. (stack b9 b4)
   deleted: (clear b4) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b4)
   goals met: 15 of 16
71. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 14 of 16
72. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 16 of 16
